app/controllers/foods_controller.rb

  def index
    search = params[:search]
    if search != 'undefined'
      results = Food.where("parameterized_name like ?", "%#{search}%")
    else
      results = Food.all
---
SELECT "foods".* FROM "foods" WHERE "foods"."name" = $1  [["name", "trigo"]]
SELECT "foods".* FROM "foods" WHERE (parameterized_name like '%%')

  def create
    Food.create(name: params[:name], parameterized_name: ActiveSupport::Inflector.parameterize(params[:name]), energy: params[:energy], fat: params[:fat], carbohydrates: params[:carbohydrates], :protein => params[:protein])
---
INSERT INTO "foods" ("name", "parameterized_name", "energy", "fat", "carbohydrates", "protein", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"

  def destroy
    Food.find(params[:id]).destroy
---
DELETE FROM "foods" WHERE "foods"."id" = $1  [["id", 16]]
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 16], ["LIMIT", 1]]

  def update
    food = Food.find(params[:id])
    food.update(food_params)
---
SELECT "foods".* FROM "foods" WHERE "foods"."id" = $1 LIMIT $2  [["id", 14], ["LIMIT", 1]]
UPDATE "foods" SET "name" = $1, "updated_at" = $2 WHERE "foods"."id" = $3  [["name", "Sopa de espinafres"], ["updated_at", "2020-12-17 09:57:50.710061"], ["id", 4]]